burgrp/py32-svd/svd/py32md310xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <description>CRC calculation unit</description>
      <groupName>CRC</groupName>
      <baseAddress>0x40023000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DR</name>
          <displayName>DR</displayName>
          <description>Data register</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DR</name>
              <description>Data Register</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <displayName>IDR</displayName>
          <description>Independent Data register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>IDR</name>
              <description>Independent Data register</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Control register</description>
          <addressOffset>0x8</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>RESET</name>
              <description>Reset bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DBGMCU</name>
      <description>Debug support</description>
      <groupName>DBGMCU</groupName>
      <baseAddress>0x40015800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IDCODE</name>
          <displayName>IDCODE</displayName>
          <description>MCU Device ID Code Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Debug MCU Configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>DBG_STOP</name>
              <description>Debug Stop Mode</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_FZ1</name>
          <displayName>APB_FZ1</displayName>
          <description>APB Freeze Register1</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DBG_TIMER3_STOP</name>
              <description>Debug Timer 3 stopped when Core is halted</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DBG_RTC_STOP</name>
              <description>Debug RTC stopped when Core is halted</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DBG_WWDG_STOP</name>
              <description>Debug Window Wachdog stopped when Core is halted</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DBG_IWDG_STOP</name>
              <description>Debug Independent Wachdog stopped when Core is halted</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DBG_LPTIM_STOP</name>
              <description>Debug LPTIM stopped when Core is halted</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_FZ2</name>
          <displayName>APB_FZ2</displayName>
          <description>APB Freeze Register2</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DBG_TIMER1_STOP</name>
              <description>Debug Timer 1 stopped when Core is halted</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DBG_TIMER14_STOP</name>
              <description>Debug Timer 14 stopped when Core is halted</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DBG_TIMER16_STOP</name>
              <description>Debug Timer 16 stopped when Core is halted</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>DBG_TIMER17_STOP</name>
              <description>Debug Timer 17 stopped when Core is halted</description>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>Direct memory access</description>
      <groupName>DMA</groupName>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA_Channel1</name>
        <description>DMA Channel 1 Interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>DMA_Channel2_3</name>
        <description>DMA Channel 2 and Channel 3 Interrupt</description>
        <value>10</value>
      </interrupt>
      <registers>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>DMA interrupt status register(DMA_ISR)</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>GIF1</name>
              <description>Channel 1 Global interrupt flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIF1</name>
              <description>Channel 1 Transfer Completeflag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HTIF1</name>
              <description>Channel 1 Half Transfer Completeflag</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TEIF1</name>
              <description>Channel 1 Transfer Errorflag</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>GIF2</name>
              <description>Channel 2 Global interruptflag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TCIF2</name>
              <description>Channel 2 Transfer Completeflag</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>HTIF2</name>
              <description>Channel 2 Half Transfer Completeflag</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TEIF2</name>
              <description>Channel 2 Transfer Errorflag</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>GIF3</name>
              <description>Channel 3 Global interruptflag</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TCIF3</name>
              <description>Channel 3 Transfer Completeflag</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>HTIF3</name>
              <description>Channel 3 Half Transfer Completeflag</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TEIF3</name>
              <description>Channel 3 Transfer Errorflag</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCR</name>
          <displayName>IFCR</displayName>
          <description>DMA interrupt flag clear register(DMA_IFCR)</description>
          <addressOffset>0x4</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>CGIF1</name>
              <description>Channel 1 Global interruptclear</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CTCIF1</name>
              <description>Channel 1 Transfer Completeclear</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHTIF1</name>
              <description>Channel 1 Half Transferclear</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CTEIF1</name>
              <description>Channel 1 Transfer Errorclear</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CGIF2</name>
              <description>Channel 2 Global interruptclear</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CTCIF2</name>
              <description>Channel 2 Transfer Completeclear</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHTIF2</name>
              <description>Channel 2 Half Transferclear</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CTEIF2</name>
              <description>Channel 2 Transfer Errorclear</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CGIF3</name>
              <description>Channel 3 Global interruptclear</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CTCIF3</name>
              <description>Channel 3 Transfer Completeclear</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CHTIF3</name>
              <description>Channel 3 Half Transferclear</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CTEIF3</name>
              <description>Channel 3 Transfer Errorclear</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <displayName>CCR1</displayName>
          <description>DMA channel configuration register(DMA_CCR)</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer complete interruptenable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HTIE</name>
              <description>Half Transfer interruptenable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer error interruptenable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>Data transfer direction</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral increment mode</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory increment mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral size</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory size</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>Channel Priority level</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory to memory mode</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR1</name>
          <displayName>CNDTR1</displayName>
          <description>DMA channel 1 number of dataregister</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of data to transfer</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR1</name>
          <displayName>CPAR1</displayName>
          <description>DMA channel 1 peripheral addressregister</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR1</name>
          <displayName>CMAR1</displayName>
          <description>DMA channel 1 memory addressregister</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <displayName>CCR2</displayName>
          <description>DMA channel configuration register(DMA_CCR)</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer complete interruptenable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HTIE</name>
              <description>Half Transfer interruptenable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer error interruptenable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>Data transfer direction</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral increment mode</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory increment mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral size</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory size</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>Channel Priority level</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory to memory mode</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR2</name>
          <displayName>CNDTR2</displayName>
          <description>DMA channel 2 number of dataregister</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of data to transfer</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR2</name>
          <displayName>CPAR2</displayName>
          <description>DMA channel 2 peripheral addressregister</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR2</name>
          <displayName>CMAR2</displayName>
          <description>DMA channel 2 memory addressregister</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR3</name>
          <displayName>CCR3</displayName>
          <description>DMA channel configuration register(DMA_CCR)</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer complete interruptenable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HTIE</name>
              <description>Half Transfer interruptenable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer error interruptenable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>Data transfer direction</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral increment mode</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory increment mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral size</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory size</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>Channel Priority level</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory to memory mode</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR3</name>
          <displayName>CNDTR3</displayName>
          <description>DMA channel 3 number of dataregister</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of data to transfer</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR3</name>
          <displayName>CPAR3</displayName>
          <description>DMA channel 3 peripheral addressregister</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR3</name>
          <displayName>CMAR3</displayName>
          <description>DMA channel 3 memory addressregister</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
